Revit 2026 API

# TileTileLineShift Property

---

The property labeled "Line Shift" from the "Tile" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string TileLineShift { get; }
```
```vb
Public Shared ReadOnly Property TileLineShift As String
	Get
```
```cpp
public:
static property String^ TileLineShift {
	String^ get ();
}
```
```fsharp
static member TileLineShift : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 100".

#### Reference

Tile Class

Autodesk.Revit.DB.Visual Namespace